Autodesk.Revit.DB.Structure.Hub
Represents a connection between two or more Autodesk Revit Elements.
Remarks:
Elements connected via a Hub do not refer directly to each other - they each refer to the Hub that keeps all the connectivity information.
In 2012 Hubs connect only structural Analytical Model Elements.
Since:
2012